13/data/attachments/23b4e6529957e952.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b0e9a363-8ee3-4b94-a37a-9758285a8b80</nif:username>
            <nif:friendToBeAdded>Henry_forward_Friend_59954_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>